print("这是我记录学习python的文件")
'''
python学习：
1.两种运行方式：1.直接在终端使用（交互式）2.终端python +文件所在的路劲
2.在python的安装目录：
	.exe：python的解释器
	.dll：编译器和虚拟机所在位置
3.创建项目后，存放位置的.idea是项目的缓存和配置文件，还有main.py
# 注释：#（单行注释）''''''(多行注释)，快捷键是ctrl+/
# 调试：选择断点，debug运行，F8快捷键下一行
# 命名规范：
# 字母数字下划线，不能以下划线开头
# 1.驼峰命名法：myNameTohka
# 2.类ruby:my_name_tohka
# 代码的执行顺序是由上及下，注意规范和格式
# 四则运算：+ — * / //(整除) %（取余/模）**（幂运算）
# 逻辑运算符： not> and> or
# 比较运算符： > < = >= <= !=
# 数据结构: int float str bool, 函数type(),不同数据类型之间
# 可以相互转换
print(type(str(7)))
# if语句：
'''
if 表达式:
    代码1
elif 表达式:
    代码2
else:
    代码3
'''
# while循环
'''
while 表达式:
    代码4
'''
# break:跳出当前循环
# contiune:提前结束本次循环，下面代码不会执行
'''
